Documents/ЗаказНаКлининг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказНаКлининг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКлиентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектКлининга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыКлининга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиКлининга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаказНаКлининг/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектКлинингаПриИзменении(Элемент)

	Объект.Адрес = "";
	Объект.Площадь = 0;

	Если ЗначениеЗаполнено(Объект.ОбъектКлининга) Тогда
		Данные = ПолучитьДанныеОбъектаКлинингаНаСервере(Объект.ОбъектКлининга);
		Если Данные <> Неопределено Тогда
			Если Данные.Свойство("Адрес") Тогда
				Объект.Адрес = Данные.Адрес;
			КонецЕсли;
			Если Данные.Свойство("Площадь") Тогда
				Объект.Площадь = Данные.Площадь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ПересчитатьСуммыПоТЧ();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОбъектаКлинингаНаСервере(СсылкаОбъектаКлининга) Экспорт

	Если НЕ ЗначениеЗаполнено(СсылкаОбъектаКлининга) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		ОбъектКл = СсылкаОбъектаКлининга.ПолучитьОбъект();
	Исключение
		Возврат Неопределено;
	КонецПопытки;

	Рез = Новый Структура;
	Попытка Рез.Вставить("Адрес", ОбъектКл.Адрес); Исключение КонецПопытки;
	Попытка Рез.Вставить("Площадь", ОбъектКл.Площадь); Исключение КонецПопытки;

	Возврат Рез;

КонецФункции

&НаКлиенте
Процедура ПлощадьПриИзменении(Элемент)
	
	ПересчитатьСуммыПоТЧ();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)

		Стр = Неопределено;
	Попытка
		Стр = Элементы.Услуги.ТекущиеДанные;
	Исключение
				Возврат;
	КонецПопытки;

	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	
	Если ЗначениеЗаполнено(Стр.Услуга) Тогда
		Стр.Цена = ПолучитьЦенуУслугиНаСервере(Стр.Услуга);
	Иначе
		Стр.Цена = 0;
	КонецЕсли;

	ПересчитатьСуммыПоТЧ();

КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ПересчитатьСуммыПоТЧ();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ПересчитатьСуммыПоТЧ();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуУслугиНаСервере(СсылкаУслуги) Экспорт

	Если НЕ ЗначениеЗаполнено(СсылкаУслуги) Тогда
		Возврат 0;
	КонецЕсли;

	Попытка
		Усл = СсылкаУслуги.ПолучитьОбъект();
	Исключение
		Возврат 0;
	КонецПопытки;

	Попытка
		Возврат Усл.Цена;
	Исключение
		Возврат 0;
	КонецПопытки;

КонецФункции

&НаКлиенте
Процедура ПересчитатьСуммыПоТЧ()

	Пл = 0;
	Если ЗначениеЗаполнено(Объект.Площадь) Тогда
		Пл = Объект.Площадь;
	КонецЕсли;

	Итог = 0;

	Для Каждого Стр Из Объект.Услуги Цикл

		Если НЕ ЗначениеЗаполнено(Стр.Количество) Тогда
			Стр.Количество = 0;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Стр.Цена) Тогда
			Стр.Цена = 0;
		КонецЕсли;

		Стр.Сумма = Пл * Стр.Количество * Стр.Цена;
		Итог = Итог + Стр.Сумма;

	КонецЦикла;

	Объект.СуммаДокумента = Итог;

КонецПроцедуры
